# Data mining with python

## import

In [119]:
# Imports

# pandas
import pandas as pd
from pandas import Series,DataFrame

# numpy, matplotlib, seaborn
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('whitegrid')
%matplotlib inline
import graphviz
from sklearn import tree

# machine learning
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB

from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import classification_report, confusion_matrix

## read csv file and show some

In [120]:
# get titanic & test csv files as a DataFrame
titanic_df = pd.read_csv("./titanic_data_set/train.csv")

# preview the data
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## show info to find null values

In [121]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

## drop unnecessary columns

In [122]:
# drop unnecessary columns, these columns won't be useful in analysis and prediction
titanic_df = titanic_df.drop(['PassengerId','Name','Ticket', 'Embarked', 'Cabin'], axis=1)
titanic_df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

## Sex : male = 1, female = 0

In [123]:
list = []
for x in titanic_df['Sex'] :
    if (x == 'male') :
        list.append(1)
    else :
        list.append(0)
# titanic_df['Sex'] = pd.cut(titanic_df.Sex, labels=['0', '1'])
titanic_df['Sex'] = list
titanic_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

# convert continuous variable to a categorical variable
### in this case, convert age and fare

In [124]:
x = pd.cut(np.array([.2, 1.4, 2.5, 6.2, 9.7, 2.1]), 3, labels=['low', 'med', 'high'])
x

[low, low, low, med, high, low]
Categories (3, object): [low < med < high]

In [125]:
titanic_df.Age = pd.cut(list, 3, labels=[0, 1, 2])
titanic_df.Fare = pd.cut(list, 3, labels=[0, 1, 2])
titanic_df.head()

   Survived  Pclass  Sex Age  SibSp  Parch Fare
0         0       3    1   2      1      0    2
1         1       1    0   0      1      0    0
2         1       3    0   0      0      0    0
3         1       1    0   0      1      0    0
4         0       3    1   2      0      0    2

In [126]:
x = titanic_df.Age.values.astype(int)
titanic_df.Age = x
titanic_df.head()

   Survived  Pclass  Sex  Age  SibSp  Parch Fare
0         0       3    1    2      1      0    2
1         1       1    0    0      1      0    0
2         1       3    0    0      0      0    0
3         1       1    0    0      1      0    0
4         0       3    1    2      0      0    2

In [127]:
x = titanic_df.Fare.values.astype(int)
titanic_df.Fare = x
titanic_df.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Fare
0         0       3    1    2      1      0     2
1         1       1    0    0      1      0     0
2         1       3    0    0      0      0     0
3         1       1    0    0      1      0     0
4         0       3    1    2      0      0     2

In [128]:
X = titanic_df.drop('Survived', axis=1)
y = titanic_df['Survived']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20)

In [129]:
X_train.head()

     Pclass  Sex  Age  SibSp  Parch  Fare
190       2    0    0      0      0     0
513       1    0    0      1      0     0
319       1    0    0      1      1     0
882       3    0    0      0      0     0
410       3    1    2      0      0     2

In [130]:
X_test.head()

     Pclass  Sex  Age  SibSp  Parch  Fare
378       3    1    2      0      0     2
74        3    1    2      0      0     2
620       3    1    2      1      0     2
490       3    1    2      1      0     2
70        2    1    2      0      0     2

In [131]:
y_train.head()

190    1
513    1
319    1
882    0
410    0
Name: Survived, dtype: int64

In [132]:
y_test.head()

378    0
74     1
620    0
490    0
70     0
Name: Survived, dtype: int64

In [133]:
classifier = DecisionTreeClassifier()
classifier.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [134]:
y_pred = classifier.predict(X_test)

In [157]:
print(confusion_matrix(y_test, y_pred))

[[103  11]
 [ 35  30]]

In [154]:
print(classification_report(y_test, y_pred))

             precision    recall  f1-score   support

          0       0.75      0.90      0.82       114
          1       0.73      0.46      0.57        65

avg / total       0.74      0.74      0.73       179

In [137]:
clf = tree.DecisionTreeClassifier()
clf = clf.fit(X_train, y_train)

In [141]:
dot_data = tree.export_graphviz(clf, out_file=None) 
graph = graphviz.Source(dot_data) 
graph.render("graphviz")

'graphviz.pdf'

In [139]:
X_train.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [153]:
dot_data = tree.export_graphviz(clf, out_file=None,
                         feature_names=X_train.columns,
                         class_names=y_train.name,
                         filled=True, rounded=True,
                         special_characters=True)
graph = graphviz.Source(dot_data)  
graph.render("1")

CalledProcessError: Command '['dot', '-Tpdf', '-O', '1']' returned non-zero exit status 1.